; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v4 ?v5)
             (pred_10 ?v12 ?v3)
             (pred_4 ?v4 ?v3)
             (pred_11 ?v10 ?v4 )
	     (pred_5 ?v4)
             (pred_6 ?v2)
             (pred_9 ?v12)
             (pred_8 ?v3)
             (pred_7 ?v4)
             (pred_2 ?v12)
             (pred_3 ?v4)
             (pred_1 ))



(:action op_3
:parameters (?v11 ?v9 ?v8 ?v6)
:precondition (and (pred_6 ?v11) (pred_6 ?v9) (pred_9 ?v8) (pred_8 ?v6)
          (pred_12 ?v11 ?v9) (pred_10 ?v8 ?v6)
                   (pred_4 ?v9 ?v6) (pred_5 ?v11) 
                   (pred_7 ?v9) (pred_2 ?v8))
:effect (and  (pred_3 ?v9) (not (pred_7 ?v9))))


(:action op_1
:parameters (?v11 ?v1)
:precondition (and (pred_6 ?v11) (pred_6 ?v1)
               (pred_5 ?v11) (pred_12 ?v11 ?v1) (pred_3 ?v1))
:effect (and (pred_5 ?v1) (not (pred_5 ?v11))))

(:action op_2
:parameters (?v11 ?v8)
:precondition (and (pred_6 ?v11) (pred_9 ?v8) 
                  (pred_5 ?v11) (pred_11 ?v8 ?v11) (pred_1 ))
:effect (and (pred_2 ?v8)
   (not (pred_11 ?v8 ?v11)) (not (pred_1 ))))


(:action op_5
:parameters (?v11 ?v13 ?v7)
:precondition (and (pred_6 ?v11) (pred_9 ?v13) (pred_9 ?v7)
                  (pred_5 ?v11) (pred_2 ?v7) (pred_11 ?v13 ?v11))
:effect (and (pred_2 ?v13) (pred_11 ?v7 ?v11)
        (not (pred_2 ?v7)) (not (pred_11 ?v13 ?v11))))

(:action op_4
:parameters (?v11 ?v8)
:precondition (and (pred_6 ?v11) (pred_9 ?v8) 
                  (pred_5 ?v11) (pred_2 ?v8))
:effect (and (pred_1 ) (pred_11 ?v8 ?v11) (not (pred_2 ?v8)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_19 obj_13 obj_15 obj_01 obj_04 obj_09 obj_18 obj_08 obj_16 obj_11 obj_02 obj_10 obj_03 obj_21 obj_12 obj_06
    obj_05 obj_14
    obj_17 obj_07 obj_20
    )

    (:init
       (pred_1)

       (pred_6 obj_19)
       (pred_6 obj_13)
       (pred_6 obj_15)
       (pred_6 obj_01)
       (pred_6 obj_04)
       (pred_6 obj_09)
       (pred_6 obj_18)
       (pred_6 obj_08)
       (pred_6 obj_16)
       (pred_6 obj_11)
       (pred_6 obj_02)
       (pred_6 obj_10)
       (pred_6 obj_03)
       (pred_6 obj_21)
       (pred_6 obj_12)
       (pred_6 obj_06)
       (pred_8 obj_05)
       (pred_8 obj_14)
       (pred_9 obj_17)
       (pred_9 obj_07)
       (pred_9 obj_20)

       (pred_12 obj_19 obj_04)
       (pred_12 obj_19 obj_13)
       (pred_12 obj_13 obj_09)
       (pred_12 obj_13 obj_15)
       (pred_12 obj_13 obj_19)
       (pred_12 obj_15 obj_18)
       (pred_12 obj_15 obj_01)
       (pred_12 obj_15 obj_13)
       (pred_12 obj_01 obj_08)
       (pred_12 obj_01 obj_15)
       (pred_12 obj_04 obj_16)
       (pred_12 obj_04 obj_09)
       (pred_12 obj_04 obj_19)
       (pred_12 obj_09 obj_11)
       (pred_12 obj_09 obj_18)
       (pred_12 obj_09 obj_13)
       (pred_12 obj_09 obj_04)
       (pred_12 obj_18 obj_02)
       (pred_12 obj_18 obj_08)
       (pred_12 obj_18 obj_15)
       (pred_12 obj_18 obj_09)
       (pred_12 obj_08 obj_10)
       (pred_12 obj_08 obj_01)
       (pred_12 obj_08 obj_18)
       (pred_12 obj_16 obj_03)
       (pred_12 obj_16 obj_11)
       (pred_12 obj_16 obj_04)
       (pred_12 obj_11 obj_21)
       (pred_12 obj_11 obj_02)
       (pred_12 obj_11 obj_09)
       (pred_12 obj_11 obj_16)
       (pred_12 obj_02 obj_12)
       (pred_12 obj_02 obj_10)
       (pred_12 obj_02 obj_18)
       (pred_12 obj_02 obj_11)
       (pred_12 obj_10 obj_06)
       (pred_12 obj_10 obj_08)
       (pred_12 obj_10 obj_02)
       (pred_12 obj_03 obj_21)
       (pred_12 obj_03 obj_16)
       (pred_12 obj_21 obj_12)
       (pred_12 obj_21 obj_11)
       (pred_12 obj_21 obj_03)
       (pred_12 obj_12 obj_06)
       (pred_12 obj_12 obj_02)
       (pred_12 obj_12 obj_21)
       (pred_12 obj_06 obj_10)
       (pred_12 obj_06 obj_12)
       (pred_7 obj_21)
       (pred_7 obj_06)
       (pred_7 obj_11)
       (pred_4  obj_21 obj_05)
       (pred_4  obj_06 obj_14)
       (pred_4  obj_11 obj_05)
       (pred_3 obj_19)
       (pred_3 obj_13)
       (pred_3 obj_15)
       (pred_3 obj_01)
       (pred_3 obj_04)
       (pred_3 obj_09)
       (pred_3 obj_18)
       (pred_3 obj_08)
       (pred_3 obj_16)
       (pred_3 obj_02)
       (pred_3 obj_10)
       (pred_3 obj_03)
       (pred_3 obj_12)

       (pred_10  obj_17 obj_05)
       (pred_10  obj_07 obj_14)
       (pred_10  obj_20 obj_05)
       (pred_11 obj_17 obj_11)
       (pred_11 obj_07 obj_09)
       (pred_11 obj_20 obj_10)
       (pred_5 obj_16)
    )

    (:goal (and
       (pred_11 obj_07 obj_15)
       (pred_11 obj_20 obj_08)
    ))
(:constraints
  (always (not (pred_5 obj_18)))
)
)

; plan
1. (op_1 obj_16 obj_04)
   deleted: (pred_5 obj_16)
   added: (pred_5 obj_04)
   goals met: 0 of 2
2. (op_1 obj_04 obj_09)
   deleted: (pred_5 obj_04)
   added: (pred_5 obj_09)
   goals met: 0 of 2
3. (op_2 obj_09 obj_07)
   deleted: (pred_11 obj_07 obj_09) (pred_1)
   added: (pred_2 obj_07)
   goals met: 0 of 2
4. (op_1 obj_09 obj_13)
   deleted: (pred_5 obj_09)
   added: (pred_5 obj_13)
   goals met: 0 of 2
5. (op_1 obj_13 obj_15)
   deleted: (pred_5 obj_13)
   added: (pred_5 obj_15)
   goals met: 0 of 2
6. (op_1 obj_15 obj_01)
   deleted: (pred_5 obj_15)
   added: (pred_5 obj_01)
   goals met: 0 of 2
7. (op_1 obj_01 obj_08)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_08)
   goals met: 0 of 2
8. (op_1 obj_08 obj_10)
   deleted: (pred_5 obj_08)
   added: (pred_5 obj_10)
   goals met: 0 of 2
9. (op_5 obj_10 obj_20 obj_07)
   deleted: (pred_2 obj_07) (pred_11 obj_20 obj_10)
   added: (pred_2 obj_20) (pred_11 obj_07 obj_10)
   goals met: 0 of 2
10. (op_1 obj_10 obj_08)
   deleted: (pred_5 obj_10)
   added: (pred_5 obj_08)
   goals met: 0 of 2
11. (op_4 obj_08 obj_20)
   deleted: (pred_2 obj_20)
   added: (pred_1) (pred_11 obj_20 obj_08)
   goals met: 1 of 2
12. (op_1 obj_08 obj_10)
   deleted: (pred_5 obj_08)
   added: (pred_5 obj_10)
   goals met: 1 of 2
13. (op_2 obj_10 obj_07)
   deleted: (pred_11 obj_07 obj_10) (pred_1)
   added: (pred_2 obj_07)
   goals met: 1 of 2
14. (op_1 obj_10 obj_08)
   deleted: (pred_5 obj_10)
   added: (pred_5 obj_08)
   goals met: 1 of 2
15. (op_1 obj_08 obj_01)
   deleted: (pred_5 obj_08)
   added: (pred_5 obj_01)
   goals met: 1 of 2
16. (op_1 obj_01 obj_15)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_15)
   goals met: 1 of 2
17. (op_4 obj_15 obj_07)
   deleted: (pred_2 obj_07)
   added: (pred_1) (pred_11 obj_07 obj_15)
   goals met: 2 of 2
